In [1]:
import numpy as np
import pandas as pd

In [2]:
frame = pd.DataFrame({'key1':['a','s','a','s','g'],'key2':['one','two','three','four','five'],'data1':range(5),'data2':np.random.randn(5)})

In [3]:
frame

  key1   key2  data1     data2
0    a    one      0 -0.036106
1    s    two      1 -0.075084
2    a  three      2  0.060368
3    s   four      3  0.205534
4    g   five      4  0.959336

In [4]:
for name,group in frame.groupby(frame['key1']):
    print(name)
    print("===================")
    print(group)
    print('~~~~~~~~~~~~~~~~~~~~')

a
===================
  key1   key2  data1     data2
0    a    one      0 -0.036106
2    a  three      2  0.060368
~~~~~~~~~~~~~~~~~~~~
g
===================
  key1  key2  data1     data2
4    g  five      4  0.959336
~~~~~~~~~~~~~~~~~~~~
s
===================
  key1  key2  data1     data2
1    s   two      1 -0.075084
3    s  four      3  0.205534
~~~~~~~~~~~~~~~~~~~~

In [5]:
dictor = dict(list(frame.groupby('key1')))

In [6]:
print(dictor)

{'a':   key1   key2  data1     data2
0    a    one      0 -0.036106
2    a  three      2  0.060368, 'g':   key1  key2  data1     data2
4    g  five      4  0.959336, 's':   key1  key2  data1     data2
1    s   two      1 -0.075084
3    s  four      3  0.205534}

In [7]:
dictor['s']

  key1  key2  data1     data2
1    s   two      1 -0.075084
3    s  four      3  0.205534

In [8]:
frame['data1'].groupby(frame['data1'])

In [9]:
frame['data1']

0    0
1    1
2    2
3    3
4    4
Name: data1, dtype: int64

In [10]:
frame['key1']

0    a
1    s
2    a
3    s
4    g
Name: key1, dtype: object

In [11]:
frame[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4

In [12]:
tips = pd.read_csv('E:/Datawhale数据分析/PythonForDataAnalysis-master/PythonForDataAnalysis-master/ch08/tips.csv')

In [13]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [14]:
tips['tips_pct'] = tips['tip']/tips['total_bill']

In [15]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tips_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [16]:
groups = tips.groupby(['day','smoker'])

In [17]:
groups['tips_pct'].mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tips_pct, dtype: float64

In [18]:
groups['tips_pct'].agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tips_pct, dtype: float64

In [19]:
print(groups['tips_pct'].agg(['mean'])) #注意与上面的区别

                 mean
day  smoker
Fri  No      0.151650
     Yes     0.174783
Sat  No      0.158048
     Yes     0.147906
Sun  No      0.160113
     Yes     0.187250
Thur No      0.160298
     Yes     0.163863

In [20]:
tips.groupby(['day','smoker']).agg(['mean'])

            total_bill       tip      size  tips_pct
                  mean      mean      mean      mean
day  smoker
Fri  No      18.420000  2.812500  2.250000  0.151650
     Yes     16.813333  2.714000  2.066667  0.174783
Sat  No      19.661778  3.102889  2.555556  0.158048
     Yes     21.276667  2.875476  2.476190  0.147906
Sun  No      20.506667  3.167895  2.929825  0.160113
     Yes     24.120000  3.516842  2.578947  0.187250
Thur No      17.113111  2.673778  2.488889  0.160298
     Yes     19.190588  3.030000  2.352941  0.163863

In [22]:
tips.groupby(['day','smoker'],as_index=False).agg(['mean'],as_index=False).reset_index()

    day smoker total_bill       tip      size  tips_pct
                     mean      mean      mean      mean
0   Fri     No  18.420000  2.812500  2.250000  0.151650
1   Fri    Yes  16.813333  2.714000  2.066667  0.174783
2   Sat     No  19.661778  3.102889  2.555556  0.158048
3   Sat    Yes  21.276667  2.875476  2.476190  0.147906
4   Sun     No  20.506667  3.167895  2.929825  0.160113
5   Sun    Yes  24.120000  3.516842  2.578947  0.187250
6  Thur     No  17.113111  2.673778  2.488889  0.160298
7  Thur    Yes  19.190588  3.030000  2.352941  0.163863